     A* Copyright 2023 Patrik Schindler <poc@pocnet.net>.
     A*
     A* This file is part of the IBM Documentation Utilities, to be found on
     A* https://github.com/PoC-dev/ibmdocs-tools
     A* see there for further details.
     A*
     A* This is free software; you can redistribute it and/or modify it
     A* under the terms of the GNU General Public License as published by the
     A* Free Software Foundation; either version 2 of the License, or (at your
     A* option) any later version.
     A*
     A* It is distributed in the hope that it will be useful, but WITHOUT
     A* ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
     A* FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
     A* for more details.
     A*
     A* You should have received a copy of the GNU General Public License along
     A* with it; if not, write to the Free Software Foundation, Inc., 59
     A* Temple Place, Suite 330, Boston, MA 02111-1307 USA or get it at
     A* http://www.gnu.org/licenses/gpl.html
     A*
     A* Record Format Name -----------------------------------------------------
     A          R NBRCHKTBL                 PFILE(IBMDOCPF)
     A* Data fields
     A            DOCNBR
     A            TITLE
     A* Indexes
     A          K DOCNBR
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
