     A* Record Format Name -----------------------------------------------------
     A          R BCKPOS3                   PFILE(IBMDOCPF)
     A* Data fields
     A            DOCNBR
     A            RELEASED
     A* Indexes
     A          K RELEASED
     A          K DOCNBR
     A*
     A* Record Format Name -----------------------------------------------------
     A          R FWDPOS3                   PFILE(IBMDOCPF)
     A* Data fields
     A            DOCNBR
     A            TITLE
     A            RELEASED
     A* Indexes
     A          K RELEASED
     A          K DOCNBR
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
