     A* Globals ----------------------------------------------------------------
     A                                      UNIQUE
     A* Record Format Name -----------------------------------------------------
     A          R DOCTBL
     A* Data fields
     A            TITLE        180A
     A            DOCNBR        18A
     A            RELEASED       4B 0       DFT(1960)
     A            SUBTITLE     180A         ALWNULL
     A* Index field(s)
     A          K DOCNBR
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent
